In [1]:
import pandas as pd

In [10]:
df=pd.read_csv('data/survey_results_public.csv')

In [7]:
people={"first":["dwarak","ram","nag"],
       "last":["nath","nath","laxmi"],
       "age":["27","45","40"]}

In [8]:
data=pd.DataFrame(people)

In [9]:
data

    first   last age
0  dwarak   nath  27
1     ram   nath  45
2     nag  laxmi  40

In [11]:
data.columns

Index(['first', 'last', 'age'], dtype='object')

In [12]:
data.columns=["first_name","last","age"]

In [13]:
data.columns

Index(['first_name', 'last', 'age'], dtype='object')

In [14]:
data.columns=[x.upper() for x in data.columns]

In [15]:
data.columns

Index(['FIRST_NAME', 'LAST', 'AGE'], dtype='object')

In [17]:
data.columns.str.replace("_"," ")

Index(['FIRST NAME', 'LAST', 'AGE'], dtype='object')

In [19]:
data.rename(columns={"FIRST_NAME":"firstname", "AGE":"age"}, inplace=True)

In [20]:
data

  firstname   LAST age
0    dwarak   nath  27
1       ram   nath  45
2       nag  laxmi  40

In [21]:
data.loc[2]

firstname      nag
LAST         laxmi
age             40
Name: 2, dtype: object

In [22]:
data.loc[2,'age']

'40'

In [23]:
data.loc[2,'age']="39"

In [24]:
data

  firstname   LAST age
0    dwarak   nath  27
1       ram   nath  45
2       nag  laxmi  39

In [25]:
data.applymap(str.upper)

  firstname   LAST age
0    DWARAK   NATH  27
1       RAM   NATH  45
2       NAG  LAXMI  39

In [28]:
data['age'].apply(len)

0    2
1    2
2    2
Name: age, dtype: int64

In [31]:
data['LAST'].map({'nath':'NATH'})

0    NATH
1    NATH
2     NaN
Name: LAST, dtype: object

In [30]:
data

  firstname   LAST age
0    dwarak   nath  27
1       ram   nath  45
2       nag  laxmi  39

In [33]:
data['LAST']=data['LAST'].replace({'nath':'Nath'})

In [34]:
data

  firstname   LAST age
0    dwarak   Nath  27
1       ram   Nath  45
2       nag  laxmi  39

In [36]:
df.rename(columns={'ConvertedComp':'SalaryUSD'}, inplace=True)

In [37]:
df.columns

Index(['Respondent', 'MainBranch', 'Hobbyist', 'OpenSourcer', 'OpenSource',
       'Employment', 'Country', 'Student', 'EdLevel', 'UndergradMajor',
       'EduOther', 'OrgSize', 'DevType', 'YearsCode', 'Age1stCode',
       'YearsCodePro', 'CareerSat', 'JobSat', 'MgrIdiot', 'MgrMoney',
       'MgrWant', 'JobSeek', 'LastHireDate', 'LastInt', 'FizzBuzz',
       'JobFactors', 'ResumeUpdate', 'CurrencySymbol', 'CurrencyDesc',
       'CompTotal', 'CompFreq', 'SalaryUSD', 'WorkWeekHrs', 'WorkPlan',
       'WorkChallenge', 'WorkRemote', 'WorkLoc', 'ImpSyn', 'CodeRev',
       'CodeRevHrs', 'UnitTests', 'PurchaseHow', 'PurchaseWhat',
       'LanguageWorkedWith', 'LanguageDesireNextYear', 'DatabaseWorkedWith',
       'DatabaseDesireNextYear', 'PlatformWorkedWith',
       'PlatformDesireNextYear', 'WebFrameWorkedWith',
       'WebFrameDesireNextYear', 'MiscTechWorkedWith',
       'MiscTechDesireNextYear', 'DevEnviron', 'OpSys', 'Containers',
       'BlockchainOrg', 'BlockchainIs', 'BetterLife', 'ITperson', 'OffOn',
       'SocialMedia', 'Extraversion', 'ScreenName', 'SOVisit1st',
       'SOVisitFreq', 'SOVisitTo', 'SOFindAnswer', 'SOTimeSaved',
       'SOHowMuchTime', 'SOAccount', 'SOPartFreq', 'SOJobs', 'EntTeams',
       'SOComm', 'WelcomeChange', 'SONewContent', 'Age', 'Gender', 'Trans',
       'Sexuality', 'Ethnicity', 'Dependents', 'SurveyLength', 'SurveyEase'],
      dtype='object')

In [39]:
df['Hobbyist'].map({'Yes':True,'No':False})

0         True
1        False
2         True
3        False
4         True
         ...
88878     True
88879    False
88880    False
88881    False
88882     True
Name: Hobbyist, Length: 88883, dtype: bool